Конфигурация отчетов/Documents/ЗапросНаУдалениеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗапросНаУдалениеСчета</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтмен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Documents/ЗапросНаУдалениеСчета/Ext/ManagerModule.bsl
Функция СоздатьЗаявкуУдаленияСчета(Заведение, НомерСчета, Сумма, ПричинаОтмены, Коментарий, СтатусВыполнения) Экспорт 
	
	Док = Документы.ЗапросНаУдалениеСчета.СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	Док.Заведение = Заведение;
	Док.НомерСчета = НомерСчета;
	Док.Сумма = Сумма;
	Док.ПричинаОтмены = ПричинаОтмены;
	Док.Коментарий = Коментарий;
	Док.СтатусВыполнения = СтатусВыполнения;
	Док.Записать();
	
	Возврат Док.Ссылка;
	
КонецФункции

Функция ПроверкаНаУдалениеСчета(Заведение, НомерСчета) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапросНаУдалениеСчета.Заведение КАК Заведение,
		|	ЗапросНаУдалениеСчета.НомерСчета КАК НомерСчета
		|ИЗ
		|	Документ.ЗапросНаУдалениеСчета КАК ЗапросНаУдалениеСчета
		|ГДЕ
		|	ЗапросНаУдалениеСчета.Заведение = &Заведение
		|	И ЗапросНаУдалениеСчета.НомерСчета = &НомерСчета";
	
	Запрос.УстановитьПараметр("Заведение", Заведение);
	Запрос.УстановитьПараметр("НомерСчета", НомерСчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Истина;
		Прервать;	
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции
